[
    {
        "title": "Create an Account",
        "content": [
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770321662/loginPageScreenshot1_hptlfv.png",
                "text": "To start, create an account or use an existing Google or GitHub account to sign in."
            }
        ]
    },
    {
        "title": "Create a Survey",
        "content": [
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770322025/homePageScreenshot1_m4pvce.png",
                "text": "When you log in, you'll be greeted by the Home Page. Click the 'Create Survey' button in the upper-right corner of the page to create your first survey (Note: You can also create a new survey using the corresponding link in the Navigation Bar. The Navigation Bar can be opened by clicking the icon in upper-left corner of the page)."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770322135/createPageScreenshot1_bsaicb.png",
                "text": "Pictured above is a fresh, unpopulated survey. So far, the only detail we've assigned to the survey is its name ('My First Survey'). Before we proceed, notice in the very top-right corner of the Create Survey Page, there's a label stating 'Invite Only' with a toggle button immediately to its right. Toggling this option on will make your survey private (evidently, this means only those you invite to participate in the survey may access it); for the sake of simplicity, we'll leave this option alone for this demonstration. To add a new question to the survey, click the 'Add Question' button in the upper-right corner of the page. There are currently 4 types of questions we can add to a survey (we'll cover each one in this section and introduce more details as we go). Newly added questions default to a Multiple Choice type; let's try adding one now."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770322338/createPageFirstQuestion_qdj74x.png",
                "text": "Pictured above is a fresh, unpopulated Multiple Choice question. A Multiple Choice question may have multiple answers, but only one answer may be selected when a participant is answering the question. Every question type requires some text to be input in the actual 'Question' field itself."
            },
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770322418/createPageFirstAnswer_jsr9kb.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770322515/createPageMultipleChoiceComplete_fta4gi.png"
                ],
                "text": "Click the 'Add Answer' button at the bottom-right of the question panel to add a new answer to the question. Enter an answer choice into the answer field and click the check mark next to the input to assign the answer to the question. Notice that even once an answer is assigned, you can click the 'x' mark next to it to delete it. Let's add another question to this survey."
            },
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770322725/createPageChecklistEmpty_csmigv.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770322736/createPageChecklistComplete_iflyfc.png"
                ],
                "text": "We can click the 'Change Type' button in the top-right corner of the question panel to change to a different type of question. Pictured above, we see a Check List type; a Check List question may have multiple answers and a participant will be able to select multiple answers when answering the question."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770322974/createPageRankingComplete_gfn2tx.png",
                "text": "Pictured above is a fully populated Ranking question. A participant answering a Ranking question will have to compare each possible answer against one another, then assign a ranking to each one. We've left the specification of higher number vs. lower number priority up to you (this might make more sense later when we cover how to answer this type of question)."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770323136/createPageRatingComplete_xxfdsn.png",
                "text": "Lastly, we have the Rating question. A Rating question does not require any answer choices be manually input when creating a survey. Instead, participants will be able to give the question a rating between 1 and 5 (inclusive) when responding to this type of question. Notice the 'Optional' toggle button at the bottom of this question panel (and every other question). If we toggle this on for any question, then participants won't have to answer those particular questions before submitting a survey. Once you've added all the questions you'd like to see in your survey, click the 'Create' button at the top-right corner of the page to create your new survey."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770323297/MySurveysPageScreenshot1_nmsfap.png",
                "text": "Once you successfully create a survey, you'll be automatically navigated to the My Surveys Page where you can see all your created surveys. Notice that our newly created survey populates the list as well."
            }
        ]
    },
    {
        "title": "Participating in a Survey",
        "content": [
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770323483/homePageBrowseLink_vgmt7p.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770323579/browsePageScreenshot1_oyxrph.png"
                ],
                "text": "To see available surveys, click the 'Browse' button in the Navigation Bar; this will navigate you to the survey catalog. Click the 'Participate' button on a survey of your choice to begin taking the survey. Note that private surveys (indicated by the red lock symbol) require an invite to participate."
            },
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770323774/takePageMultipleChoice_v011b9.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770323832/takePageCheckList_dm72mx.png"
                ],
                "text": "You won't be able to submit a survey until all required questions are answered. Use the arrows in the top-right corner of the page to move between questions."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770324009/takePageRanking_dnzqzx.png",
                "text": "Ranking questions differ notably from other question types. Firstly, the default ranking assignment (from top to bottom) is 1, 2, 3, 4. Since this technically does count as a valid placement of answers for the Ranking question, making this question optional has no effect."
            },
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770324085/takePageRankingSelect_l59du8.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770324150/takePageRankingSwap_zzhamt.png"
                ],
                "text": "To modify the ranking, first click on any one of the numbers to the left of each answer for the question; this will highlight the selected rank. Then, select a different rank you'd like to swap the previously highlighted rank with."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770324198/takePageRankingSwapped_rtdkyn.png",
                "text": "Notice the updated ranking pictured above."
            },
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770324286/takePageRating_vjh6by.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770324332/takePageRatingSelected_owfqnw.png"
                ],
                "text": "Lastly, Rating questions can be answered simply by selecting the star that corresponds with the rating you'd like to give. The left-most star corresponds to a rating of 1 and the right-most star corresponds to a rating of 5."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770324620/submittedPage_doskrt.png",
                "text": "Once all required questions have been answered, the 'Submit' button in the bottom-right corner will highlight, indicating that the survey is ready for submission. Once you are finished with your responses, click the 'Submit' button to submit the completed survey. Upon successful survey submission, you'll be navigated to the Submitted Page pictured above."
            }
        ]
    },
    {
        "title": "Invites",
        "content": [
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770325206/mySurveysPageScreenshot2_lgr6pg.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770325292/viewPage_sxhgk1.png"
                ],
                "text": "Private surveys require invites for individual participants. From the My Surveys Page, click 'View' on a survey of your choice. You'll be navigated to a page where you can review (not modify) the selected survey."
            },
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770325445/viewPageInvite_kccufy.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770325507/viewPageInviteSend_vtb1ze.png"
                ],
                "text": "Click the 'Invite' button near the top-left of the page to invite another user to participate in the displayed survey. Enter the target user's email address in the email field, then click the 'Send' button to send the invite."
            },
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770325668/homePageInvite_pdak4b.png",
                "text": "The recipient of the invite will find it in their Invite List located in their Home Page as pictured above."
            }
        ]
    },
    {
        "title": "Viewing Statistics",
        "content": [
            {
                "type": 0,
                "src": "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770326434/viewPageStats_lwasjs.png",
                "text": "From the same View Page where we could send invites (see previous section), we can also click the 'Statistics' button near the top-right of the page to navigate to the Statistics Dashboard."
            },
            {
                "type": 1,
                "src": [
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770326685/statsPageRating_ub6qzu.png",
                    "https://res.cloudinary.com/ddxyscqzm/image/upload/v1770326698/statsPageRanking_b5ckll.png"
                ],
                "text": "The Statistics Dashboard will populate with the latest submission data for a particular survey. Data is represented per question; use the arrows in the top-right of the page to move between questions. Each colored segment you see in the dashboard in each of the different charts displayed can be hovered over (or tapped on for mobile users) to view more specific details of the visual in question."
            }
        ]
    }
]
